import math as m

# Оставляй комментарии!!!
# # Пример словаря
# dic = {'Фамилия': 'Хоружий', 'Имя': 'Федор', 'Отчество ': 'Александрович'}
# for key, values in dic.items(): # cоздает кортеж (ключ, значение). и таким способом можно перебрать. как enumirate
#     print(key, values)

#
# box = dict(one=1, two=2, three='3')
#
# dic['test'] = 'add new key' # так же можно уже существующему ключу присваивать новое значение(dic[Фамилия] = Пупа)
#
# print(dic['Фамилия'], box) # Хоружий {'one': 1, 'two': 2, 'three': '3'}
#
# print(dic) #{'Фамилия': 'Хоружий', 'Имя': 'Федор', 'Отчество ': 'Александрович', 'test': 'add new key'}
# print(len(dic)) # 4
#

# lst = input().split()
# d = {} # создается пустой словарь
# for i in lst:
#     kod = i[:2] # создается переменная с начальными кодом +7
#     if kod in d.keys(): # если есть такой код в словаре
#         d[kod] += [i] # то в ключ со значением этого кода добавляется значение списка которое содержит этот код
#     else: # есле нет
#         d[kod] = [] # то создается ключ с кодом а в значение пустой список
#         d[kod]+=[i] # затем так добавляется значение списка которое содержит этот код
# # print(d)
# print(*sorted(d.items()))

# n = input().split()
# d = dict([(x[:2], [i for i in n if x[:2] == i[:2]]) for x in n])
# print(*sorted(d.items()))
# +71234567890 +71234567854 +61234576890 +52134567890 +21235777890 +21234567110 +71232267890 входные данные

# num = 1
# d = {}
# while num != 0:
#     num = int(input())
#     temp = round(m.sqrt(num), 2)
#     if num in d:
#         print(f'значение из кэша: {d[num]}')
#     elif num == 0:
#         break
#     else:
#         # temp = round(m.sqrt(num),2)
#         d[num] = temp
#         print(temp)
#
d = {' ': '-...-', 'Ё': '.', 'А': '.-', 'Б': '-...', 'В': '.--', 'Г': '--.',
     'Д': '-..', 'Е': '.', 'Ж': '...-', 'З': '--..', 'И': '..', 'Й': '.---',
     'К': '-.-', 'Л': '.-..', 'М': '--', 'Н': '-.', 'О': '---', 'П': '.--.',
     'Р': '.-.', 'С': '...', 'Т': '-', 'У': '..-', 'Ф': '..-.', 'Х': '....',
     'Ц': '-.-.', 'Ч': '---.', 'Ш': '----', 'Щ': '--.-', 'Ъ': '--.--', 'Ы': '-.--',
     'Ь': '-..-', 'Э': '..-..', 'Ю': '..--', 'Я': '.-.-'}


# d2 = {v:k for k,v in d.items()} # поменять местами ключи и значения

# name = input().split()
# print(name)
# # ' '.join(name)
# result = ''
# for i in name:
#     if i in d2:
#         result += d2.get(i)
# print(result.lower().rstrip())

num = ['3 Сергей', '5 Николай', '4 Елена', '7 Владимир', '5 Юлия', '4 Светлана']
d = dict.fromkeys(i for i in num)
print(d)
num = [i.split() for i in num]
print(num)
# for i in num:
#     if i[0] in d:
#         d[i[0]] = i[1]
# print(d)
# for key,value in d.items():
#     for i in num:
#         if key == i[0]:
#             d[i[1]]+=[i[1]]
# print(d)



